/**********************************************************************
 *	16bit TIMER0 を使用した割り込みハンドラー.
 **********************************************************************
 *	timer0_init()
 *	timer0_wait()
 */
#ifndef _timer0_h_
#define _timer0_h_

void  timer0_init(int cnt);
uchar timer0_wait(void);
int   timer0_gettime(void);

void  timer0_int_handler(void);

#endif  //_timer0_h_
/**********************************************************************
 *	
 **********************************************************************
 */
